GUdaoxi/LR_project1/Drivers/FM33LR0xx_FL_Driver/Inc/fm33lr0xx_fl_spi.h
#define    SPI_CR2_CMD8B_Pos                                      (6U)
#define    SPI_CR2_CMD8B_Msk                                      (0x1U << SPI_CR2_CMD8B_Pos)
#define    SPI_CR2_CMD8B                                          SPI_CR2_CMD8B_Msk

#define    SPI_CR2_SSNM_Pos                                       (5U)
#define    SPI_CR2_SSNM_Msk                                       (0x1U << SPI_CR2_SSNM_Pos)
#define    SPI_CR2_SSNM                                           SPI_CR2_SSNM_Msk

#define    SPI_CR2_TXO_AC_Pos                                     (4U)
#define    SPI_CR2_TXO_AC_Msk                                     (0x1U << SPI_CR2_TXO_AC_Pos)
#define    SPI_CR2_TXO_AC                                         SPI_CR2_TXO_AC_Msk

#define    SPI_CR2_TXO_Pos                                        (3U)
#define    SPI_CR2_TXO_Msk                                        (0x1U << SPI_CR2_TXO_Pos)
#define    SPI_CR2_TXO                                            SPI_CR2_TXO_Msk

#define    SPI_CR2_SSN_Pos                                        (2U)
#define    SPI_CR2_SSN_Msk                                        (0x1U << SPI_CR2_SSN_Pos)
#define    SPI_CR2_SSN                                            SPI_CR2_SSN_Msk

#define    SPI_CR2_SSNSEN_Pos                                     (1U)
#define    SPI_CR2_SSNSEN_Msk                                     (0x1U << SPI_CR2_SSNSEN_Pos)
#define    SPI_CR2_SSNSEN                                         SPI_CR2_SSNSEN_Msk

#define    SPI_CR2_SPIEN_Pos                                      (0U)
#define    SPI_CR2_SPIEN_Msk                                      (0x1U << SPI_CR2_SPIEN_Pos)
#define    SPI_CR2_SPIEN                                          SPI_CR2_SPIEN_Msk

#define    SPI_CR3_TXBFC_Pos                                      (3U)
#define    SPI_CR3_TXBFC_Msk                                      (0x1U << SPI_CR3_TXBFC_Pos)
#define    SPI_CR3_TXBFC                                          SPI_CR3_TXBFC_Msk

#define    SPI_CR3_RXBFC_Pos                                      (2U)
#define    SPI_CR3_RXBFC_Msk                                      (0x1U << SPI_CR3_RXBFC_Pos)
#define    SPI_CR3_RXBFC                                          SPI_CR3_RXBFC_Msk

#define    SPI_CR3_MERRC_Pos                                      (1U)
#define    SPI_CR3_MERRC_Msk                                      (0x1U << SPI_CR3_MERRC_Pos)
#define    SPI_CR3_MERRC                                          SPI_CR3_MERRC_Msk

#define    SPI_CR3_SERRC_Pos                                      (0U)
#define    SPI_CR3_SERRC_Msk                                      (0x1U << SPI_CR3_SERRC_Pos)
#define    SPI_CR3_SERRC                                          SPI_CR3_SERRC_Msk

#define    SPI_I2S_IER_SSNRIE_Pos                                 (5U)
#define    SPI_I2S_IER_SSNRIE_Msk                                 (0x1U << SPI_I2S_IER_SSNRIE_Pos)
#define    SPI_I2S_IER_SSNRIE                                     SPI_I2S_IER_SSNRIE_Msk

#define    SPI_I2S_IER_SSNFIE_Pos                                 (4U)
#define    SPI_I2S_IER_SSNFIE_Msk                                 (0x1U << SPI_I2S_IER_SSNFIE_Pos)
#define    SPI_I2S_IER_SSNFIE                                     SPI_I2S_IER_SSNFIE_Msk

#define    SPI_I2S_IER_TXSEIE_Pos                                 (3U)
#define    SPI_I2S_IER_TXSEIE_Msk                                 (0x1U << SPI_I2S_IER_TXSEIE_Pos)
#define    SPI_I2S_IER_TXSEIE                                     SPI_I2S_IER_TXSEIE_Msk

#define    SPI_I2S_IER_ERRIE_Pos                                  (2U)
#define    SPI_I2S_IER_ERRIE_Msk                                  (0x1U << SPI_I2S_IER_ERRIE_Pos)
#define    SPI_I2S_IER_ERRIE                                      SPI_I2S_IER_ERRIE_Msk

#define    SPI_I2S_IER_TXBEIE_Pos                                 (1U)
#define    SPI_I2S_IER_TXBEIE_Msk                                 (0x1U << SPI_I2S_IER_TXBEIE_Pos)
#define    SPI_I2S_IER_TXBEIE                                     SPI_I2S_IER_TXBEIE_Msk

#define    SPI_I2S_IER_RXIE_Pos                                   (0U)
#define    SPI_I2S_IER_RXIE_Msk                                   (0x1U << SPI_I2S_IER_RXIE_Pos)
#define    SPI_I2S_IER_RXIE                                       SPI_I2S_IER_RXIE_Msk

#define    SPI_I2S_ISR_DCN_TX_Pos                                 (12U)
#define    SPI_I2S_ISR_DCN_TX_Msk                                 (0x1U << SPI_I2S_ISR_DCN_TX_Pos)
#define    SPI_I2S_ISR_DCN_TX                                     SPI_I2S_ISR_DCN_TX_Msk

#define    SPI_I2S_ISR_RXCOL_Pos                                  (10U)
#define    SPI_I2S_ISR_RXCOL_Msk                                  (0x1U << SPI_I2S_ISR_RXCOL_Pos)
#define    SPI_I2S_ISR_RXCOL                                      SPI_I2S_ISR_RXCOL_Msk

#define    SPI_I2S_ISR_TXCOL_Pos                                  (9U)
#define    SPI_I2S_ISR_TXCOL_Msk                                  (0x1U << SPI_I2S_ISR_TXCOL_Pos)
#define    SPI_I2S_ISR_TXCOL                                      SPI_I2S_ISR_TXCOL_Msk

#define    SPI_I2S_ISR_BUSY_Pos                                   (8U)
#define    SPI_I2S_ISR_BUSY_Msk                                   (0x1U << SPI_I2S_ISR_BUSY_Pos)
#define    SPI_I2S_ISR_BUSY                                       SPI_I2S_ISR_BUSY_Msk


#define    SPI_I2S_ISR_MERR_Pos                                   (6U)
#define    SPI_I2S_ISR_MERR_Msk                                   (0x1U << SPI_I2S_ISR_MERR_Pos)
#define    SPI_I2S_ISR_MERR                                       SPI_I2S_ISR_MERR_Msk

#define    SPI_I2S_ISR_SERR_Pos                                   (5U)
#define    SPI_I2S_ISR_SERR_Msk                                   (0x1U << SPI_I2S_ISR_SERR_Pos)
#define    SPI_I2S_ISR_SERR                                       SPI_I2S_ISR_SERR_Msk

#define    SPI_I2S_ISR_SSNR_Pos                                   (4U)
#define    SPI_I2S_ISR_SSNR_Msk                                   (0x1U << SPI_I2S_ISR_SSNR_Pos)
#define    SPI_I2S_ISR_SSNR                                       SPI_I2S_ISR_SSNR_Msk

