GUdaoxi/LR_project1/Drivers/FM33LR0xx_FL_Driver/Inc/fm33lr0xx_fl_spi.h
/**
  * @brief    Enable SNN Sofe Control Under Master Mode
  * @rmtoll   CR2    SSNSEN    FL_SPI_EnableSSNSoftControl
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_EnableSSNSoftControl(SPI_Type *SPIx)
{
    SET_BIT(SPIx->CR2, SPI_CR2_SSNSEN_Msk);
}

/**
  * @brief    Get SNN Sofe Control State Under Master Mode
  * @rmtoll   CR2    SSNSEN    FL_SPI_IsEnabledSSNSoftControl
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_IsEnabledSSNSoftControl(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_SSNSEN_Msk) == SPI_CR2_SSNSEN_Msk);
}

/**
  * @brief    Disable SNN Sofe Control Under Master Mode
  * @rmtoll   CR2    SSNSEN    FL_SPI_DisableSSNSoftControl
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_DisableSSNSoftControl(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->CR2, SPI_CR2_SSNSEN_Msk);
}

/**
  * @brief    Enable SPI
  * @rmtoll   CR2    SPIEN    FL_SPI_Enable
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_Enable(SPI_Type *SPIx)
{
    SET_BIT(SPIx->CR2, SPI_CR2_SPIEN_Msk);
}

/**
  * @brief    Get SPI Enable Status
  * @rmtoll   CR2    SPIEN    FL_SPI_IsEnabled
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_IsEnabled(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->CR2, SPI_CR2_SPIEN_Msk) == SPI_CR2_SPIEN_Msk);
}

/**
  * @brief    Disable SPI
  * @rmtoll   CR2    SPIEN    FL_SPI_Disable
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_Disable(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->CR2, SPI_CR2_SPIEN_Msk);
}

/**
  * @brief    Clear SPI TX Buffer
  * @rmtoll   CR3    TXBFC    FL_SPI_ClearTXBuff
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_ClearTXBuff(SPI_Type *SPIx)
{
    WRITE_REG(SPIx->CR3, SPI_CR3_TXBFC_Msk);
}

/**
  * @brief    Clear SPI RX Buffer
  * @rmtoll   CR3    RXBFC    FL_SPI_ClearRXBuff
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_ClearRXBuff(SPI_Type *SPIx)
{
    WRITE_REG(SPIx->CR3, SPI_CR3_RXBFC_Msk);
}

/**
  * @brief    Clear SPI Master Error Flag
  * @rmtoll   CR3    MERRC    FL_SPI_ClearFlag_MasterError
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_ClearFlag_MasterError(SPI_Type *SPIx)
{
    WRITE_REG(SPIx->CR3, SPI_CR3_MERRC_Msk);
}

/**
  * @brief    Clear SPI Slave Error Flag
  * @rmtoll   CR3    SERRC    FL_SPI_ClearFlag_SlaveError
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_ClearFlag_SlaveError(SPI_Type *SPIx)
{
    WRITE_REG(SPIx->CR3, SPI_CR3_SERRC_Msk);
}

/**
  * @brief    Disable SPI Slave SSN Rise Interrupt
  * @rmtoll   IER    SSNRIE    FL_SPI_DisableIT_SlaveSSNRise
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_DisableIT_SlaveSSNRise(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->IER, SPI_I2S_IER_SSNRIE_Msk);
}

/**
  * @brief    Enable SPI Slave SSN Rise Interrupt
  * @rmtoll   IER    SSNRIE    FL_SPI_EnableIT_SlaveSSNRise
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_EnableIT_SlaveSSNRise(SPI_Type *SPIx)
{
    SET_BIT(SPIx->IER, SPI_I2S_IER_SSNRIE_Msk);
}

/**
  * @brief    Get SPI Slave SSN Rise Interrupt Enable Status
  * @rmtoll   IER    SSNRIE    FL_SPI_IsEnabledIT_SlaveSSNRise
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_IsEnabledIT_SlaveSSNRise(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->IER, SPI_I2S_IER_SSNRIE_Msk) == SPI_I2S_IER_SSNRIE_Msk);
}

/**
  * @brief    Disable SPI Slave SSN Fail Interrupt
  * @rmtoll   IER    SSNFIE    FL_SPI_DisableIT_SlaveSSNFail
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_DisableIT_SlaveSSNFail(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->IER, SPI_I2S_IER_SSNFIE_Msk);
}

/**
  * @brief    Enable SPI Slave SSN Fail Interrupt
  * @rmtoll   IER    SSNFIE    FL_SPI_EnableIT_SlaveSSNFail
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_EnableIT_SlaveSSNFail(SPI_Type *SPIx)
{
    SET_BIT(SPIx->IER, SPI_I2S_IER_SSNFIE_Msk);
}

/**
  * @brief    Get SPI Slave SSN Fail Interrupt Enable Status
  * @rmtoll   IER    SSNFIE    FL_SPI_IsEnabledIT_SlaveSSNFail
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_IsEnabledIT_SlaveSSNFail(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->IER, SPI_I2S_IER_SSNFIE_Msk) == SPI_I2S_IER_SSNFIE_Msk);
}

/**
  * @brief    Disable SPI Transmit Shift Empty Interrupt
  * @rmtoll   IER    TXSEIE    FL_SPI_I2S_DisableIT_TXShiftEmptyComplete
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_I2S_DisableIT_TXShiftEmptyComplete(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->IER, SPI_I2S_IER_TXSEIE_Msk);
}

/**
  * @brief    Enable SPI Transmit Shift Empty Interrupt
  * @rmtoll   IER    TXSEIE    FL_SPI_I2S_EnableIT_TXShiftEmptyComplete
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_I2S_EnableIT_TXShiftEmptyComplete(SPI_Type *SPIx)
{
    SET_BIT(SPIx->IER, SPI_I2S_IER_TXSEIE_Msk);
}

/**
  * @brief    Get SPI Transmit Shift Empty Interrupt Enable Status
  * @rmtoll   IER    TXSEIE    FL_SPI_I2S_IsEnabledIT_TXShiftEmptyComplete
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_I2S_IsEnabledIT_TXShiftEmptyComplete(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->IER, SPI_I2S_IER_TXSEIE_Msk) == SPI_I2S_IER_TXSEIE_Msk);
}

/**
  * @brief    Disable SPI Error Interrupt
  * @rmtoll   IER    ERRIE    FL_SPI_I2S_DisableIT_Error
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_I2S_DisableIT_Error(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->IER, SPI_I2S_IER_ERRIE_Msk);
}

/**
  * @brief    Enable SPI Error Interrupt
  * @rmtoll   IER    ERRIE    FL_SPI_I2S_EnableIT_Error
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_I2S_EnableIT_Error(SPI_Type *SPIx)
{
    SET_BIT(SPIx->IER, SPI_I2S_IER_ERRIE_Msk);
}

/**
  * @brief    Get SPI Error Interrupt Enable Status
  * @rmtoll   IER    ERRIE    FL_SPI_I2S_IsEnabledIT_Error
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_I2S_IsEnabledIT_Error(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->IER, SPI_I2S_IER_ERRIE_Msk) == SPI_I2S_IER_ERRIE_Msk);
}

/**
  * @brief    Disable SPI Transmit Buffer Empty Interrupt
  * @rmtoll   IER    TXBEIE    FL_SPI_I2S_DisableIT_TXBufferEmptyComplete
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_I2S_DisableIT_TXBufferEmptyComplete(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->IER, SPI_I2S_IER_TXBEIE_Msk);
}

/**
  * @brief    Enable SPI Transmit Buffer Empty Interrupt
  * @rmtoll   IER    TXBEIE    FL_SPI_I2S_EnableIT_TXBufferEmptyComplete
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_I2S_EnableIT_TXBufferEmptyComplete(SPI_Type *SPIx)
{
    SET_BIT(SPIx->IER, SPI_I2S_IER_TXBEIE_Msk);
}

/**
  * @brief    Get SPI Transmit Buffer Empty Interrupt Enable Status
  * @rmtoll   IER    TXBEIE    FL_SPI_I2S_IsEnabledIT_TXBufferEmptyComplete
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_I2S_IsEnabledIT_TXBufferEmptyComplete(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->IER, SPI_I2S_IER_TXBEIE_Msk) == SPI_I2S_IER_TXBEIE_Msk);
}

/**
  * @brief    Disable SPI Receive Complete Interrupt
  * @rmtoll   IER    RXIE    FL_SPI_I2S_DisableIT_RXComplete
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_I2S_DisableIT_RXComplete(SPI_Type *SPIx)
{
    CLEAR_BIT(SPIx->IER, SPI_I2S_IER_RXIE_Msk);
}

/**
  * @brief    Enable SPI Receive Complete Interrupt
  * @rmtoll   IER    RXIE    FL_SPI_I2S_EnableIT_RXComplete
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_I2S_EnableIT_RXComplete(SPI_Type *SPIx)
{
    SET_BIT(SPIx->IER, SPI_I2S_IER_RXIE_Msk);
}

/**
  * @brief    Get SPI Receive Complete Interrupt Enable Status
  * @rmtoll   IER    RXIE    FL_SPI_I2S_IsEnabledIT_RXComplete
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_I2S_IsEnabledIT_RXComplete(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->IER, SPI_I2S_IER_RXIE_Msk) == SPI_I2S_IER_RXIE_Msk);
}

/**
  * @brief    Set SPI Output Data/Command Under Half-Duplex Mode
  * @rmtoll   ISR    DCN_TX    FL_SPI_SetFrameMode
  * @param    SPIx SPI instance
  * @param    mode This parameter can be one of the following values:
  *           @arg @ref FL_SPI_I2S_FRAME_MODE_CMD
  *           @arg @ref FL_SPI_I2S_FRAME_MODE_DATA
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_SetFrameMode(SPI_Type *SPIx, uint32_t mode)
{
    MODIFY_REG(SPIx->ISR, SPI_I2S_ISR_DCN_TX_Msk, mode);
}

/**
  * @brief    Get SPI Output Data/Command Under Half-Duplex Mode Setting
  * @rmtoll   ISR    DCN_TX    FL_SPI_GetFrameMode
  * @param    SPIx SPI instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_SPI_I2S_FRAME_MODE_CMD
  *           @arg @ref FL_SPI_I2S_FRAME_MODE_DATA
  */
__STATIC_INLINE uint32_t FL_SPI_GetFrameMode(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_I2S_ISR_DCN_TX_Msk));
}

/**
  * @brief    Get SPI Receive Collision Flag
  * @rmtoll   ISR    RXCOL    FL_SPI_I2S_IsActiveFlag_RXBuffOverflow
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_I2S_IsActiveFlag_RXBuffOverflow(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_I2S_ISR_RXCOL_Msk) == (SPI_I2S_ISR_RXCOL_Msk));
}

/**
  * @brief    Clear SPI Receive Collision Flag
  * @rmtoll   ISR    RXCOL    FL_SPI_I2S_ClearFlag_RXBuffOverflow
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_I2S_ClearFlag_RXBuffOverflow(SPI_Type *SPIx)
{
    WRITE_REG(SPIx->ISR, SPI_I2S_ISR_RXCOL_Msk);
}

/**
  * @brief    Get SPI Transmit Collision Flag
  * @rmtoll   ISR    TXCOL    FL_SPI_I2S_IsActiveFlag_TXBuffOverflow
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_I2S_IsActiveFlag_TXBuffOverflow(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_I2S_ISR_TXCOL_Msk) == (SPI_I2S_ISR_TXCOL_Msk));
}

/**
  * @brief    Clear SPI Transmit Collision Flag
  * @rmtoll   ISR    TXCOL    FL_SPI_I2S_ClearFlag_TXBuffOverflow
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_I2S_ClearFlag_TXBuffOverflow(SPI_Type *SPIx)
{
    WRITE_REG(SPIx->ISR, SPI_I2S_ISR_TXCOL_Msk);
}

/**
  * @brief    Get SPI Busy Flag
  * @rmtoll   ISR    BUSY    FL_SPI_I2S_IsActiveFlag_Busy
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_I2S_IsActiveFlag_Busy(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_I2S_ISR_BUSY_Msk) == (SPI_I2S_ISR_BUSY_Msk));
}


/**
  * @brief    Get SPI Master Error Flag
  * @rmtoll   ISR    MERR    FL_SPI_IsActiveFlag_MasterError
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_IsActiveFlag_MasterError(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_I2S_ISR_MERR_Msk) == (SPI_I2S_ISR_MERR_Msk));
}

/**
  * @brief    Get SPI Slave Error Flag
  * @rmtoll   ISR    SERR    FL_SPI_IsActiveFlag_SlaveError
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_IsActiveFlag_SlaveError(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_I2S_ISR_SERR_Msk) == (SPI_I2S_ISR_SERR_Msk));
}

/**
  * @brief    Get SPI Slave SSN Rise Flag
  * @rmtoll   ISR    SSNR    FL_SPI_IsActiveFlag_SlaveSSNRise
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_IsActiveFlag_SlaveSSNRise(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_I2S_ISR_SSNR_Msk) == (SPI_I2S_ISR_SSNR_Msk));
}

/**
  * @brief    Clear SPI Slave SSN Rise Flag
  * @rmtoll   ISR    SSNR    FL_SPI_ClearFlag_SlaveSSNRise
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_ClearFlag_SlaveSSNRise(SPI_Type *SPIx)
{
    WRITE_REG(SPIx->ISR, SPI_I2S_ISR_SSNR_Msk);
}

/**
  * @brief    Get SPI Slave SSN Fail Flag
  * @rmtoll   ISR    SSNF    FL_SPI_IsActiveFlag_SlaveSSNFail
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_IsActiveFlag_SlaveSSNFail(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_I2S_ISR_SSNF_Msk) == (SPI_I2S_ISR_SSNF_Msk));
}

/**
  * @brief    Clear SPI Slave SSN Fail Flag
  * @rmtoll   ISR    SSNF    FL_SPI_ClearFlag_SlaveSSNFail
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_ClearFlag_SlaveSSNFail(SPI_Type *SPIx)
{
    WRITE_REG(SPIx->ISR, SPI_I2S_ISR_SSNF_Msk);
}

/**
  * @brief    Get SPI TX Shift Empty Flag
  * @rmtoll   ISR    TXSE    FL_SPI_I2S_IsActiveFlag_TXShiftEmpty
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_I2S_IsActiveFlag_TXShiftEmpty(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_I2S_ISR_TXSE_Msk) == (SPI_I2S_ISR_TXSE_Msk));
}

/**
  * @brief    Clear TX Shift Empty Flag
  * @rmtoll   ISR    TXSE    FL_SPI_I2S_ClearFlag_TXShiftEmpty
  * @param    SPIx SPI instance
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_I2S_ClearFlag_TXShiftEmpty(SPI_Type *SPIx)
{
    WRITE_REG(SPIx->ISR, SPI_I2S_ISR_TXSE_Msk);
}

/**
  * @brief    Get SPI TX Buffer Empty Flag
  * @rmtoll   ISR    TXBE    FL_SPI_I2S_IsActiveFlag_TXBuffEmpty
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_I2S_IsActiveFlag_TXBuffEmpty(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_I2S_ISR_TXBE_Msk) == (SPI_I2S_ISR_TXBE_Msk));
}

/**
  * @brief    Get SPI RX Buffer Full Flag
  * @rmtoll   ISR    RXBF    FL_SPI_I2S_IsActiveFlag_RXBuffFull
  * @param    SPIx SPI instance
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_SPI_I2S_IsActiveFlag_RXBuffFull(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->ISR, SPI_I2S_ISR_RXBF_Msk) == (SPI_I2S_ISR_RXBF_Msk));
}

/**
  * @brief    Write SPI TX Buffer
  * @rmtoll   TXBUF        FL_SPI_I2S_WriteTXBuff
  * @param    SPIx SPI instance
  * @param    data
  * @retval   None
  */
__STATIC_INLINE void FL_SPI_I2S_WriteTXBuff(SPI_Type *SPIx, uint32_t data)
{
    MODIFY_REG(SPIx->TXBUF, (0xffffffffU << 0U), (data << 0U));
}

/**
  * @brief    Read SPI TX Buffer
  * @rmtoll   RXBUF        FL_SPI_I2S_ReadRXBuff
  * @param    SPIx SPI instance
  * @retval
  */
__STATIC_INLINE uint32_t FL_SPI_I2S_ReadRXBuff(SPI_Type *SPIx)
{
    return (uint32_t)(READ_BIT(SPIx->RXBUF, (0xffffffffU << 0U)) >> 0U);
}

/**
  * @}
  */

/** @defgroup SPI_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_SPI_DeInit(SPI_Type *SPIx);
FL_ErrorStatus FL_SPI_Init(SPI_Type *SPIx, FL_SPI_InitTypeDef *initStruct);
void FL_SPI_StructInit(FL_SPI_InitTypeDef *initStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33LR0XX_FL_SPI_H*/


/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
